Ра_новая/src/Documents/СчетФактураВыданный/СчетФактураВыданный.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СчетФактураВыданный</name>
  <comment>Счет фактура </comment>
  <basedOn>Document.Акт</basedOn>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.Акт</types>
    </type>
  </attributes>
  <attributes>
    <name>Отвественный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Document>

Ра_новая/src/Enums/ОтветственныеЛица/ОтветственныеЛица.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ОтветственныеЛица</name>
  <enumValues>
    <name>ГлавныйБухгалтер</name>
  </enumValues>
  <enumValues>
    <name>Исполнитель</name>
  </enumValues>
  <enumValues>
    <name>Кассир</name>
  </enumValues>
  <enumValues>
    <name>Руководитель</name>
  </enumValues>
</mdclass:Enum>

Ра_новая/src/Documents/Акт/Акт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Акт</name>
  <basedOn>Document.Счет</basedOn>
  <registerRecords>AccumulationRegister.ВзаиморасчетыПоАктам</registerRecords>
  <attributes>
    <name>Грузоотправитель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Грузополучатель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВозвратаВБухгалтерию</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Копия</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.Счет</types>
    </type>
  </attributes>
  <attributes>
    <name>Отвественный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СчетФактура</name>
    <type>
      <types>DocumentRef.СчетФактураВыданный</types>
    </type>
  </attributes>
  <attributes>
    <name>Закрыт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.Статусы</types>
    </type>
  </attributes>
  <attributes>
    <name>Инвестор</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Стройка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СметнаяСтоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Продукция</types>
      </type>
    </attributes>
    <attributes>
      <name>КодЗаказа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>14</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Всего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Ра_новая/src/Documents/СчетФактураВыданный/ManagerModule.bsl
Процедура ПечатьСчетаФактуры(ТабДок, ПараметрКоманды) Экспорт 
	СчетФактура451 = Ложь;
	Если ПараметрКоманды.Дата>'20210701' Тогда
		Макет = ПолучитьМакет("ПФ_MXL_СчетФактура451"); 
		СчетФактура451 = Истина;	
	Иначе 	
		Макет = ПолучитьМакет("СчетФактура1137");
	КонецЕсли;

	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	номер = ПараметрКоманды.Номер;
	Пока Лев(Номер, 1)="0" Цикл
		Номер = Сред(Номер, 2);
	КонецЦикла;
	
	//{+} ип_СРВ 02.12.21 
	ОбластьМакета.Параметры.Номер = номер; 
	ОбластьМакета.Параметры.Дата = Формат(ПараметрКоманды.Дата, "ДФ='дд ММММ гггг'")+ " г.";
	//{-} ип_СРВ

	ОбластьМакета.Параметры.ПредставлениеПоставщика = "Продавец: " + ПараметрКоманды.Организация.Наименование;
	ОбластьМакета.Параметры.АдресПоставщика			= ПараметрКоманды.Организация.ФактическийАдрес;
	ОбластьМакета.Параметры.ИННпоставщика           = "ИНН/КПП продавца: " +ПараметрКоманды.Организация.ИНН+"/"+ПараметрКоманды.Организация.КПП;
	Если ЗначениеЗаполнено(ПараметрКоманды.Основание.Грузоотправитель) Тогда 
		ОбластьМакета.Параметры.ПредставлениеГрузоотправителя =	"Грузоотправитель и его адрес: " +ПараметрКоманды.Основание.Грузоотправитель;
	иначе	
		ОбластьМакета.Параметры.ПредставлениеГрузоотправителя = "Грузоотправитель и его адрес: " +"---";
	КонецЕсли;
	Если ЗначениеЗаполнено(ПараметрКоманды.Основание.Грузополучатель) Тогда
		ОбластьМакета.Параметры.ПредставлениеГрузополучателя  = "Грузополучатель и его адрес: " +ПараметрКоманды.Основание.Грузополучатель;
	иначе	
		ОбластьМакета.Параметры.ПредставлениеГрузополучателя  = "Грузополучатель и его адрес: " +ПараметрКоманды.Основание.Контрагент.НаименованиеПолное+" "+ПараметрКоманды.Основание.Контрагент.ЮридическийАдрес;
	КонецЕсли;
	Строка_ПоДокументу = "К платежно-расчетному документу №_______________от__________";
	ОбластьМакета.Параметры.ПоДокументу                   = Строка_ПоДокументу;
	ОбластьМакета.Параметры.ПредставлениеПокупателя       = "Покупатель: "  + ПараметрКоманды.Контрагент.НаименованиеПолное;
	ОбластьМакета.Параметры.АдресПокупателя               = "Адрес: "       + ПараметрКоманды.Контрагент.ЮридическийАдрес;
	ОбластьМакета.Параметры.ИННПокупателя                 = "ИНН/КПП покупателя: "+ ПараметрКоманды.Контрагент.ИНН+"/"+ПараметрКоманды.Контрагент.КПП;	 

	ТабДок.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("ЗаголовокТаблицы");	
	ТабДок.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Строка");

	ИтогоСуммаНДС = 0;
	ИтогоВсего    = 0;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументОснование", ПараметрКоманды.Основание);

	Запрос.Текст =
	 "ВЫБРАТЬ
	 |	АктТовары.Ссылка.Организация,
	 |	АктТовары.Ссылка.Организация КАК Поставщик,
	 |	АктТовары.Ссылка.Контрагент КАК Покупатель,
	 |	АктТовары.Ссылка.СуммаДокумента КАК Сумма,
	 |	АктТовары.Номенклатура КАК Товар,
	 |	СУММА(АктТовары.Количество) КАК Количество,
	 |	АктТовары.Цена,
	 |	АктТовары.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	 |	СУММА(АктТовары.Сумма) КАК Стоимость,
	 |	СУММА(АктТовары.СуммаНДС) КАК СуммаНДС,
	 |	СУММА(АктТовары.Всего) КАК Всего,
	 |	АктТовары.НДС КАК СтавкаНДС,
	 |	""--"" КАК СтранаПроисхожденияКод,
	 |	""--"" КАК ПредставлениеСтраны,
	 |	""--"" КАК ПредставлениеГТД,
	 |	ВЫРАЗИТЬ(АктТовары.Номенклатура.Наименование КАК СТРОКА(1000)) КАК ТоварНаименование
	 |ИЗ
	 |	Документ.Акт.Товары КАК АктТовары
	 |ГДЕ
	 |	АктТовары.Ссылка = &ДокументОснование
	 |
	 |СГРУППИРОВАТЬ ПО
	 |	АктТовары.Цена,
	 |	АктТовары.Ссылка.Организация,
	 |	АктТовары.Ссылка.Контрагент,
	 |	АктТовары.Ссылка.СуммаДокумента,
	 |	АктТовары.Номенклатура,
	 |	АктТовары.Номенклатура.ЕдиницаИзмерения,
	 |	АктТовары.НДС,
	 |	ВЫРАЗИТЬ(АктТовары.Номенклатура.Наименование КАК СТРОКА(1000)),
	 |	АктТовары.Ссылка.Организация";
	 
	ВыборкаСтрокТовары = Запрос.Выполнить().Выбрать();
	
	ИтогоСуммаНДС = 0;
	ИтогоВсего    = 0;

	Пока ВыборкаСтрокТовары.Следующий() Цикл
		ОбластьМакета.Параметры.Заполнить(ВыборкаСтрокТовары);
		
		ИтогоСуммаНДС = ИтогоСуммаНДС + ВыборкаСтрокТовары.СуммаНДС;
		ИтогоВсего    = ИтогоВсего    + ВыборкаСтрокТовары.Всего;
      ТабДок.Вывести(ОбластьМакета);
	КонецЦикла;
   
	ОбластьМакета = Макет.ПолучитьОбласть("Итого");
	ОбластьМакета.Параметры.ИтогоСуммаНДС = ИтогоСуммаНДС;
	ОбластьМакета.Параметры.ИтогоВсего    = ИтогоВСего; 
	Если Не СчетФактура451 Тогда 
		ОбластьМакета.Параметры.ИтогоСтоимость= ПараметрКоманды.Основание.Товары.Итог("Сумма");  
	КонецЕсли;
	ТабДок.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
	Если СчетФактура451 Тогда
		ОбластьМакета.Параметры.ФИОРуководителя 		= "/"+ПолучениеСписков.ОтвественныхЛиц(ПараметрКоманды.Организация,Перечисления.ОтветственныеЛица.Руководитель,ПараметрКоманды.Дата).ФизическоеЛицо+"/";
		ОбластьМакета.Параметры.ФИОГлавногоБухгалтера	= "/"+ПолучениеСписков.ОтвественныхЛиц(ПараметрКоманды.Организация,Перечисления.ОтветственныеЛица.ГлавныйБухгалтер,ПараметрКоманды.Дата).ФизическоеЛицо+"/";	
	иначе	
		ОбластьМакета.Параметры.ФИОРуководитель = "/"+ПолучениеСписков.ОтвественныхЛиц(ПараметрКоманды.Организация,Перечисления.ОтветственныеЛица.Руководитель,ПараметрКоманды.Дата).ФизическоеЛицо+"/";
		ОбластьМакета.Параметры.ФИОглБухгалтер	= "/"+ПолучениеСписков.ОтвественныхЛиц(ПараметрКоманды.Организация,Перечисления.ОтветственныеЛица.ГлавныйБухгалтер,ПараметрКоманды.Дата).ФизическоеЛицо+"/";
	КонецЕсли;
	ТабДок.Вывести(ОбластьМакета);

КонецПроцедуры
